app/views/users/show.html.erb

SELECT  1 AS one FROM "songs" WHERE "songs"."user_id" = ? LIMIT 1  [[nil, 2]]
---
    <%= render 'follower_form' if logged_in? %>
    <% if @user.songs.any? %>