app/controllers/songs_controller.rb

INSERT INTO "songs" ("song", "uri", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["song", "Caravan Palace"], ["uri", "spotify:track:0ZG7CssB5lM2ILgJhMGNVE"], ["user_id", 1], ["created_at", "2015-12-07 06:58:46.320927"], ["updated_at", "2015-12-07 06:58:46.320927"]]
---
	def create

    spotify_tracks = RSpotify::Track.search(song_params[:song])
    puts spotify_tracks.nil? || spotify_tracks.empty?
    if spotify_tracks.nil? || spotify_tracks.empty?
      @song = current_user.songs.build(song_params)
    else
    @song.uri = current_user.songs.build(song_params.merge(uri: spotify_tracks[1].uri))
    end

    if @song.save