app/controllers/static_pages_controller.rb

SELECT  "songs".* FROM "songs" WHERE (user_id = 1) LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "songs" WHERE "songs"."user_id" = ?  [["user_id", 1]]
---
  def home
  	@song = current_user.songs.build if logged_in?
  	 @feed_items = current_user.feed.paginate(page: params[:page]) if logged_in?