app/controllers/users_controller.rb

  def show
   @user = User.find(params[:id])
    @songs = @user.songs.paginate(page: params[:page])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "songs".* FROM "songs" WHERE "songs"."user_id" = ? LIMIT 30 OFFSET 0  [["user_id", 1]]
SELECT COUNT(*) FROM "songs" WHERE "songs"."user_id" = ?  [["user_id", 1]]

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "users" SET "name" = ?, "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Test"], ["email", "test@upenn.edu"], ["password_digest", "$2a$10$I5lmWIFP/S6D2Mv9JGLBd.fHOLNPit2btdIExfIspg/v3qWAB4OOK"], ["updated_at", "2015-12-01 23:11:57.674769"], ["id", 2]]